# shell 
brew "fish"
brew "starship"
brew "tmux"
brew "atuin"

# editor
brew "neovim"

# envs
# brew "anyenv"
brew "direnv"
brew "asdf"

# fizzy finder
brew "peco"
brew "fzf"
brew "sk"    # fzf

# git manager
brew "gh"
brew "ghq"
brew "tig"
brew "git-delta"

# gorgeous shell tools (replace from...)
brew "ripgrep"   # grep
brew "bat"       # cat
brew "fd"        # find
brew "exa"       # ls
brew "htop"      # top
brew "bottom"    # top
brew "navi"      # man
brew "tealdeer"  # man
brew "bandwhich" # lsof
brew "zoxide"    # cd

# config viewer and parser
brew "jq"
brew "yq"
brew "xsv"

# traditional commands
brew "tree"
brew "telnet"
brew "wget"
brew "gsed"
brew "openssl"

# languages and its tools
brew "ninja"
brew "llvm"
brew "deno"
brew "rust-analyzer"
brew "golangci-lint"

# graphical tools
brew "graphviz"
brew "plantuml"

# terraform
tap "hashicorp/tap"
brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/terraform"
brew "tflint"

# others
brew "tokei"
brew "circleci"
brew "protobuf"
brew "flatbuffers"

# for build php
brew "bzip2"
brew "libiconv"
brew "tidy-html5"
