brew "peco"
brew "anyenv"
brew "direnv"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "neovim"
brew "peco"
brew "tmux"
brew "starship"
brew "ripgrep"
brew "bat"
brew "fd"
brew "exa"
brew "xsv"
brew "tokei"
brew "jq"