# shell 
brew "fish"
brew "starship"
brew "tmux"

# editor
brew "neovim"

# envs
brew "anyenv"
brew "direnv"

# fizzy finder
brew "peco"
brew "fzf"

# git manager
brew "gh"
brew "ghq"
brew "tig"

# gorgeous shell tools
brew "ripgrep"
brew "bat"
brew "fd"
brew "exa"
brew "xsv"
brew "tokei"

# like sed
brew "jq"
brew "yq"

# traditional commands
brew "tree"
brew "telnet"
brew "wget"
brew "gsed"

# languages and its tools
brew "deno"
brew "rust-analyzer"

# graphical tools
brew "graphviz"
brew "plantuml"

# terraform
tap "hashicorp/tap"
brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/terraform"
brew "tflint"
