tap "1password/tap"
tap "aws/tap"
tap "buildpacks/tap"
tap "clojure/tools"
tap "cloudflare/cloudflare"
tap "filosottile/musl-cross"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "johanneskaufmann/tap"
tap "k1low/tap"
# Run your GitHub Actions locally
brew "act"
# Access Log Profiler
brew "alp"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Terminal bandwidth utilization tool
brew "bandwhich"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Freely available high-quality data compressor
brew "bzip2"
# Core application library for C
brew "glib"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# C++ library for large-scale optimization
brew "ceres-solver"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl", args: ["HEAD"]
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# More intuitive version of du in rust
brew "dust"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern replacement for 'ls'
brew "exa"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Serialization library for C++, supporting Java, C#, and Go
brew "flatbuffers"
# Command-line tools for fly.io services
brew "flyctl"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Fast linters runner for Go
brew "golangci-lint"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Integration point for ghcide and haskell-ide-engine. One IDE to rule them all
brew "haskell-language-server"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# CBOR protocol implementation for C and others
brew "libcbor"
# Conversion library
brew "libiconv"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Mock code autogenerator for Golang
brew "mockery"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Small build system for use with gyp or CMake
brew "ninja"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Network Time Protocol (NTP) Distribution
brew "ntp"
# Modern shell for the GitHub era
brew "nushell"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# General-purpose speech recognition model
brew "openai-whisper"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Simplistic interactive filtering tool
brew "peco"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql@14"
# Show ps output as a tree
brew "pstree"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Fuzzy Finder in rust!
brew "sk"
# SOcket CAT: netcat on steroids
brew "socat"
# Terminal-based client for Spotify
brew "spotify-tui"
# Spotify daemon
brew "spotifyd"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Linter for Terraform files
brew "tflint"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# Linux cross compilers based on musl libc
brew "filosottile/musl-cross/musl-cross"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
brew "johanneskaufmann/tap/html2markdown"
# A Git subcommand that makes `git worktree` simple
brew "k1low/tap/git-wt"
# Command-line interface for 1Password
cask "1password-cli"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Replacement for Docker Desktop
cask "orbstack"
vscode "anthropic.claude-code"
vscode "bradymholt.pgformatter"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "saoudrizwan.claude-dev"
vscode "sourcegraph.cody-ai"
vscode "vscodevim.vim"
go "github.com/mailhog/MailHog"
go "golang.org/x/perf/cmd/benchstat"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/abekoh/get-google-tokens"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/dl/go1.18.10"
go "golang.org/dl/go1.19beta1"
go "golang.org/dl/go1.21.0"
go "golang.org/dl/go1.21rc2"
go "golang.org/dl/go1.21rc3"
go "github.com/shurcooL/goexec"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "github.com/cweill/gotests/gotests"
go "github.com/99designs/gqlgen"
go "github.com/fullstorydev/grpcurl/cmd/grpcurl"
go "github.com/josharian/impl"
go "github.com/google/ko"
go "github.com/mailhog/mhsendmail"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/golang/mock/mockgen"
go "github.com/matryer/moq"
go "github.com/dim13/otpauth"
go "connectrpc.com/connect/cmd/protoc-gen-connect-go"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/ericchiang/pup"
go "github.com/abekoh/radiko-archiver/cmd/radiko-archiver"
go "github.com/abekoh/radiko-podcast/cmd/radiko-podcast"
go "github.com/gostaticanalysis/skeleton/v2"
go "github.com/rubenv/sql-migrate/sql-migrate"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "github.com/microsoft/go-sqlcmd/cmd/sqlcmd"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/google/wire/cmd/wire"
cargo "cargo-generate"
cargo "cargo-update"
cargo "cornucopia"
cargo "diesel_cli"
cargo "dprint"
cargo "lindera-cli"
cargo "mini-redis"
cargo "rbm"
cargo "refinery_cli"
cargo "sd"
cargo "sqlx-cli"
cargo "tree-sitter-cli"
cargo "trunk"
cargo "wasm-pack"
cargo "wonnx-cli"
cargo "wordle-helper"
